УТ_для_edt/src/Documents/смартКорректировкаПланаПродаж/смартКорректировкаПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаПланаПродаж</name>
  <comment>//++ #1498 смарт: Фролов 23.10.2023 //Разработать план продаж</comment>
  <basedOn>Document.смартПланПродажПоМенеджерам</basedOn>
  <registerRecords>AccumulationRegister.смартПланПродажПоМенеджерам</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДляРасчетаРублевогоПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентИзмененияОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.смартПланПродажПоМенеджерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлана</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>EnumRef.смартВидПлана</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>СегментНоменклатуры</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
      <type>
        <types>DefinedType.Подразделение</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентИзменения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПланКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеИзменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйПланКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартПланПродажПоМенеджерам/смартПланПродажПоМенеджерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартПланПродажПоМенеджерам</name>
  <comment>//++ #1498 смарт: Фролов 17.10.2023 //Разработать план продаж</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоэффициентИзменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипУслуги</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлана</name>
    <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
    <type>
      <types>EnumRef.смартВидПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СегментНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСтатусыПланаПродаж/смартСтатусыПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыПланаПродаж</name>
  <comment>//++ #1498 смарт: Фролов 17.10.2023 //Разработать план продаж</comment>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидПлана/смартВидПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидПлана</name>
  <comment>//++ #Б-958 смарт: Фролов 26.09.2024 //Создание отчета план/факт выручка по подразделениям, менеджерам.</comment>
  <enumValues>
    <name>ПоМенеджерам</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоСегментамНоменклатуры</name>
    <comment>//++ #Б-1436 смарт: Фролов 26.11.2024 //План продаж по сегментам. Доработка справочников и документов</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартКорректировкаПланаПродаж/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.смартПланПродажПоМенеджерам.Записывать = Истина;
	
	Если Статус=перечисления.смартСтатусыПланаПродаж.Утвержден Тогда
		
		Для Каждого ТекСтрокаПланирование Из Планирование Цикл
			
			Движение = Движения.смартПланПродажПоМенеджерам.Добавить();
			Движение.Период = ТекСтрокаПланирование.Период;
			Движение.ВидПлана = ВидПлана;
			Движение.ТипУслуги = ТипУслуги;
			Движение.Менеджер = ТекСтрокаПланирование.Менеджер;
			Движение.Подразделение = ТекСтрокаПланирование.Подразделение;
			Движение.СегментНоменклатуры = ТекСтрокаПланирование.СегментНоменклатуры;
			Движение.Количество = (ТекСтрокаПланирование.НовыйПланКоличество - ТекСтрокаПланирование.СтарыйПланКоличество);
			Движение.Сумма = (ТекСтрокаПланирование.НовыйПлан - ТекСтрокаПланирование.СтарыйПлан);
			Движение.СуммаРегл = (ТекСтрокаПланирование.НовыйПлан - ТекСтрокаПланирование.СтарыйПлан) * КурсДляРасчетаРублевогоПлана;
			Движение.КоэффициентИзменения = ТекСтрокаПланирование.КоэффициентИзменения;
			Движение.Комментарий = Комментарий;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) ТОгда
		ОбщегоНазначения.СообщитьПользователю("Документ Корректировка плана, может быть создан только на основании Плана по Менеджерам");
		Возврат; 
	КонецЕсли;
	
	Если НЕ (ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Статус=Перечисления.смартСтатусыПланаПродаж.Утвержден) Тогда
		ОбщегоНазначения.СообщитьПользователю("Корректировать можно только утвержденный и проведенный документ!");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартПланПродажПоМенеджерам") Тогда
		
		КоэффициентИзмененияОбщий = 1;
		Периодичность=ДанныеЗаполнения.Периодичность;
		ВидПлана = ДанныеЗаполнения.ВидПлана;
		ТипУслуги = ДанныеЗаполнения.ТипУслуги;
		КурсДляРасчетаРублевогоПлана = ДанныеЗаполнения.КурсДляРасчетаРублевогоПлана;
		
		Если Периодичность = Перечисления.Периодичность.Месяц Тогда
			НачалоПериода = ?(НачалоМесяца(ТекущаяДата()) < ДанныеЗаполнения.НачалоПериода, ДанныеЗаполнения.НачалоПериода,НачалоМесяца(ТекущаяДата()));
		Иначе
			НачалоПериода = ?(НачалоКвартала(ТекущаяДата()) < ДанныеЗаполнения.НачалоПериода, ДанныеЗаполнения.НачалоПериода,НачалоКвартала(ТекущаяДата()));
		КонецЕсли;
		
		ОкончаниеПериода = ДанныеЗаполнения.ОкончаниеПериода;
		ДокументОснование = ДанныеЗаполнения;
		Статус=Перечисления.смартСтатусыПланаПродаж.Подготовка;
		
		Если ВидПлана = Перечисления.смартВидПлана.ПоПодразделениям Тогда
			
			МасПодразделение =  ДанныеЗаполнения.Планирование.Выгрузить(, "Подразделение").ВыгрузитьКолонку("Подразделение");
			МасПодразделение = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПодразделение);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
			|	смартПланПродажПоМенеджерамОбороты.Подразделение КАК Подразделение,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СтарыйПлан
			|ИЗ
			|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, 
			|" + ?(Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ") + ", Подразделение В (&МасПодразделение) 
			|	И ТипУслуги = &ТипУслуги И ВидПлана = &ВидПлана) КАК смартПланПродажПоМенеджерамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Период,
			|	смартПланПродажПоМенеджерамОбороты.Подразделение
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Подразделение.Наименование");
			Запрос.УстановитьПараметр("МасПодразделение", МасПодразделение);
			Запрос.УстановитьПараметр("ТипУслуги", ТипУслуги);
			Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
			Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Планирование.Добавить();
				НоваяСтрока.КоэффициентИзменения = 1;
				НоваяСтрока.Подразделение = Выборка.Подразделение;
				НоваяСтрока.НовыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.СтарыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.Период = Выборка.Период;
				
			КонецЦикла;
			
		ИначеЕсли ВидПлана = Перечисления.смартВидПлана.ПоМенеджерам Тогда	
			
			МасМенеджер = ДанныеЗаполнения.Планирование.Выгрузить(, "Менеджер").ВыгрузитьКолонку("Менеджер");
			МасМенеджер = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасМенеджер);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
			|	смартПланПродажПоМенеджерамОбороты.Менеджер КАК Менеджер,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СтарыйПлан
			|ИЗ
			|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, 
			|" + ?(Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ") + ", Менеджер В (&МасМенеджер) 
			|	И ТипУслуги = &ТипУслуги И ВидПлана = &ВидПлана) КАК смартПланПродажПоМенеджерамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Период,
			|	смартПланПродажПоМенеджерамОбороты.Менеджер
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Менеджер.Наименование");
			Запрос.УстановитьПараметр("МасМенеджер", МасМенеджер);
			Запрос.УстановитьПараметр("ТипУслуги", ТипУслуги);
			Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
			Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
			
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Планирование.Добавить();
				НоваяСтрока.КоэффициентИзменения = 1;
				НоваяСтрока.Менеджер = Выборка.Менеджер;
				НоваяСтрока.НовыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.СтарыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.Период = Выборка.Период;
				
			КонецЦикла;
			
		Иначе
			
			МасСегментов = ДанныеЗаполнения.Планирование.Выгрузить(, "СегментНоменклатуры").ВыгрузитьКолонку("СегментНоменклатуры");
			МасСегментов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасСегментов);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	смартПланПродажПоМенеджерамОбороты.Период КАК Период,
			|	смартПланПродажПоМенеджерамОбороты.СегментНоменклатуры КАК СегментНоменклатуры,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.СуммаОборот) КАК СтарыйПлан,
			|	СУММА(смартПланПродажПоМенеджерамОбороты.КоличествоОборот) КАК СтарыйПланКоличество
			|ИЗ
			|	РегистрНакопления.смартПланПродажПоМенеджерам.Обороты(&ДатаНачала, &ДатаОкончания, 
			|" + ?(Периодичность = Перечисления.Периодичность.Месяц, "МЕСЯЦ", "КВАРТАЛ") + ", СегментНоменклатуры В (&МасСегментов) 
			|	И ВидПлана = &ВидПлана) КАК смартПланПродажПоМенеджерамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.Период,
			|	смартПланПродажПоМенеджерамОбороты.СегментНоменклатуры
			|
			|УПОРЯДОЧИТЬ ПО
			|	смартПланПродажПоМенеджерамОбороты.СегментНоменклатуры.Наименование");
			Запрос.УстановитьПараметр("МасСегментов", МасСегментов);
			Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
			Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = Планирование.Добавить();
				НоваяСтрока.КоэффициентИзменения = 1;
				НоваяСтрока.СегментНоменклатуры = Выборка.СегментНоменклатуры;
				НоваяСтрока.НовыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.СтарыйПлан = Выборка.СтарыйПлан;
				НоваяСтрока.НовыйПланКоличество = Выборка.СтарыйПланКоличество;
				НоваяСтрока.СтарыйПланКоличество = Выборка.СтарыйПланКоличество;
				НоваяСтрока.Период = Выборка.Период;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
